//=============================================================================
//
//	プレスボタンUI[press button.cpp]
//	Author:吉田　悠人
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "press button ui.h"
#include "renderer.h"
#include "manager.h"

//=============================================================================
// 静的メンバー変数
//=============================================================================
TEXTURE_DATA CPressUi::m_TextureData = { NULL,	"Data/Texture/PressButton.png", };

//=============================================================================
// コンストラクタ
//=============================================================================
CPressUi::CPressUi(int nPriorit) :CUi(nPriorit)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CPressUi::~CPressUi()
{
}

//=============================================================================
// テクスチャ読み込み
//=============================================================================
HRESULT CPressUi::Load(void)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();
	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		m_TextureData.m_cFileName,
		&m_TextureData.m_pTexture);

	return S_OK;
}

//=============================================================================
// テクスチャの破棄
//=============================================================================
void CPressUi::Unload(void)
{
	//テクスチャの破棄
	if (m_TextureData.m_pTexture != NULL)
	{
		m_TextureData.m_pTexture->Release();
		m_TextureData.m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CPressUi * CPressUi::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CPressUi *pPressUi = NULL;
	pPressUi = new CPressUi;

	//NULLチェック
	if (pPressUi != NULL)
	{
		//位置設定
		pPressUi->SetPos(D3DXVECTOR3(pos.x, pos.y, pos.z));
		//サイズ設定
		pPressUi->SetSize(D3DXVECTOR3(size.x, size.y, size.z));
		//テクスチャ設定
		pPressUi->BindTexture(m_TextureData.m_pTexture);
		//初期化処理
		pPressUi->Init();
	}
	return pPressUi;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CPressUi::Init(void)
{
	CUi::Init();
	return S_OK;
}


//=============================================================================
// 更新処理
//=============================================================================
void CPressUi::Update(void)
{
	CUi::Update();
}

