//=============================================================================
//
//	タイトルロゴ[title logo.cpp]
//	Author:吉田　悠人
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "title logo.h"
#include "renderer.h"
#include "manager.h"

//=============================================================================
// 静的メンバー変数
//=============================================================================
TEXTURE_DATA CTitleLoge::m_TextureData = { NULL,	"Data/Texture/BOXSTORY.png", };

//=============================================================================
// コンストラクタ
//=============================================================================
CTitleLoge::CTitleLoge(int nPriority) :CUi(nPriority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CTitleLoge::~CTitleLoge()
{
}

//=============================================================================
// テクスチャ読み込み
//=============================================================================
HRESULT CTitleLoge::Load(void)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();
	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		m_TextureData.m_cFileName,
		&m_TextureData.m_pTexture);

	return S_OK;
}

//=============================================================================
// テクスチャの破棄
//=============================================================================
void CTitleLoge::Unload(void)
{
	//テクスチャの破棄
	if (m_TextureData.m_pTexture != NULL)
	{
		m_TextureData.m_pTexture->Release();
		m_TextureData.m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CTitleLoge * CTitleLoge::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	CTitleLoge *pTitleLoge = NULL;
	pTitleLoge = new CTitleLoge;

	//NULLチェック
	if (pTitleLoge != NULL)
	{
		//位置設定
		pTitleLoge->SetPos(D3DXVECTOR3(pos.x, pos.y, pos.z));
		//サイズ設定
		pTitleLoge->SetSize(D3DXVECTOR3(size.x, size.y, size.z));
		//テクスチャ設定
		pTitleLoge->BindTexture(m_TextureData.m_pTexture);
		//初期化処理
		pTitleLoge->Init();
	}
	return pTitleLoge;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CTitleLoge::Init(void)
{
	CUi::Init();
	return S_OK;
}

//=============================================================================
// 更新処理
//=============================================================================
void CTitleLoge::Update(void)
{
	CUi::Update();
}
